#-----------------------MTranslator-----------------------------------
import string
#python MTranslator.py

#Азбука 

ABC = {'А': '.-',
'Б': '-...',
'В': '.--',
'Г': '--.',
'Д': '-..',
'Е': '.',
'Ж': '...-',
'З': '--..',
'И': '..',
'Й': '.---',
'К': '-.-',
'Л': '.-..',
'М': '--',
'Н': '-.',
'О': '---',
'П': '.--.',
'Р': '.-.',
'С': '...',
'Т': '-',
'У': '..--',
'Ф': '..-.',
'Х': '....',
'Ц': '-.-.',
'Ч': '---.',
'Ш': '----',
'Щ': '--.-',
'Ъ': '.--.-.',
'Ы': '-.--',
'Ь': '-..-',
'Э': '..-..',
'Ю': '..--',
'Я': '.-.-',
'а': '.-',
'б': '-...',
'в': '.--',
'г': '--.',
'д': '-..',
'е': '.',
'ж': '...-',
'з': '--..',
'и': '..',
'й': '.---',
'к': '-.-',
'л': '.-..',
'м': '--',
'н': '-.',
'о': '---',
'п': '.--.',
'р': '.-.',
'с': '...',
'т': '-',
'у': '..--',
'ф': '..-.',
'х': '....',
'ц': '-.-.',
'ч': '---.',
'ш': '----',
'щ': '--.-',
'ъ': '.--.-.',
'ы': '-.--',
'ь': '-..-',
'э': '..-..',
'ю': '..--',
'я': '.-.-',
'0': '-----',
'1': '.----',
'2': '..---',
'3': '...--',
'4': '....-',
'5': '.....',
'6': '-....',
'7': '--...',
'8': '---..',
'9': '----.',
}

#Конец мучений 







#-----------------------------Заставка-----------------------------------
print ('Производство не компании - Одиночка\n')
print ('----------------------------------MTranslator----------------------------------\n')
print ('\n')

#----------------------------Главчасть------------------------------

q = True 
I_angy = ['Я ЖЕ СКАЗАЛ, ЧТОБЫ ТЫ ПЕЧАЛ НА РУССКОМ']
res = []
x = 0

while q:

	word = input ('Введите ваше слово или предложени(На русском языке): ')

	for i in word:
		if i == ' ':
			res.append (' ')
		elif i in string.punctuation:
			res.append (' ')
		else:
			try:
				res.append (ABC [i])
			except KeyError:
				print (I_angy[x])
				continue
					
	print (''.join (res))
	False_or_True = input ('Хотите повторить?(Да, Нет): ')
	if False_or_True == 'Да':
		continue
	else:
		q = False


#------------------------------Докапываемся до ползователя------------------------
print ('Просим выразить благодарность программисту, который сделал это чудо в перьях')

qq = True
while qq:
	Blag = input ('>>>')
	L_Blag = Blag.split ()
	for i in L_Blag:
		if i == 'Благодарю':
			print ("Спасибо!")
			qq = False
		else:
			print ('Я жду благодарности (%_%) (Благодарю вас ...')

print ('Всего хорошего')